app/controllers/products_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
---
  def claim
    @product = Product.find(params[:id])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 6 LIMIT 1
---
  def bid
    @product = Product.find(params[:id])