app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`sold` != FALSE
---
  def index
    @products = Product.where(:sold => false )

SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1 AND `products`.`sold` = TRUE
---
  def my_sold_products
    @products = Product.where(:user_id => current_user,:sold => true)

SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1 AND `products`.`sold` = FALSE
---
  def my_products
    @products = Product.where(:user_id => current_user,:sold => false)

SELECT `products`.* FROM `products` WHERE `products`.`current_bidder` = 'xyz' AND `products`.`sold` = FALSE
---
  def mybids
    @products = Product.where(:current_bidder => current_user.name,:sold => false)

SELECT `products`.* FROM `products` WHERE `products`.`sold` = TRUE
---
  def otherclaims
    @products = Product.where(:sold => true)

SELECT `products`.* FROM `products` WHERE `products`.`sold` = TRUE AND `products`.`current_bidder` = 'xyz@abc.com'
---
  def claimeditems
    @products = Product.where(:sold => true,:current_bidder => current_user.name)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 10 LIMIT 1
UPDATE `products` SET `current_bidder` = 'ABC', `updated_at` = '2020-04-05 11:43:25' WHERE `products`.`id` = 10
UPDATE `products` SET `current_bid` = 600 WHERE `products`.`id` = 10
---
  def bidding
    @product = Product.find(params[:id])
    @product.update_attributes(current_bidder: current_user.name)
    @product.update_attributes(current_bid: params[:bidding][:current_bid])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 8 LIMIT 1
UPDATE `products` SET `soldto` = 'xyz', `updated_at` = '2020-04-05 05:27:42' WHERE `products`.`id` = 8
UPDATE `products` SET `sold` = TRUE WHERE `products`.`id` = 8
---
  def claim
    @product = Product.find(params[:id])
    @product.update_attributes(soldto: current_user.name)
    @product.update_attributes(sold: true )

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 10 LIMIT 1
---
  def bid
    @product = Product.find(params[:id])

INSERT INTO `products` (`name`, `description`, `start_bid`, `deadline`, `contact`, `created_at`, `updated_at`, `user_id`) VALUES ('Product of XYZ', '', 500, '2020-04-05 11:45:00', '1234567891', '2020-04-05 11:23:39', '2020-04-05 11:23:39', 1)
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user
    @product.contact = current_user.phone

    respond_to do |format|
      if @product.save

UPDATE `products` SET `start_bid` = 3000, `updated_at` = '2020-04-03 16:42:33' WHERE `products`.`id` = 8
---
  def update
    respond_to do |format|
      if @product.update(product_params)